{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "DreamModel",
    "parent_library": "transformers_modules.Dream-org.Dream-v0-Instruct-7B.05334cb9faaf763692dcf9d8737c642be2b2a6ae.modeling_dream"
  },
  "base_model_name_or_path": "Dream-org/Dream-v0-Instruct-7B",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "down",
    "q_proj",
    "o_proj",
    "v_proj",
    "k_proj",
    "gate",
    "up"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}